Revit 2027 API
Document.CanEnableCloudWorksharing Method
 Checks if cloud worksharing can be enabled for the cloud model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanEnableCloudWorksharing()
Public Function CanEnableCloudWorksharing As Boolean
public:
bool CanEnableCloudWorksharing()
member CanEnableCloudWorksharing : unit -> bool
Return Value
Boolean
 True if cloud worksharing can be enabled in the document, which also means the current document is a single user cloud model, False otherwise.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace